tests/artillery/image-upload-test.yml
config:
  target: "http://node-api:5000"
  phases:
    - duration: 20  # Warm-up phase
      arrivalRate: 5  # Start with 5 per second
      rampTo: 10  # Ramp up to 10 per second
      name: "Warm-up phase"
    - duration: 40  # Ramp-up phase
      arrivalRate: 10  # Start at 10 per second
      rampTo: 35  # Ramp up to 35 per second
      name: "Ramp-up phase"
    - duration: 90  # Sustained peak load
      arrivalRate: 35  # Keep at 35 per second
      name: "Sustained peak phase"
  processor: "./curl-functions.cjs"

scenarios:
  - name: "Upload random images"
    flow:
      - function: "uploadWithCurl"
      - think: 1